{"keras_version": "2.2.0", "config": {"output_layers": [["decoder_dense", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [null, null, 100], "name": "encoder_inputs", "dtype": "float32"}, "name": "encoder_inputs", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"sparse": false, "batch_input_shape": [null, null, 100], "name": "decoder_inputs", "dtype": "float32"}, "name": "decoder_inputs", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "encoder_lstm", "activation": "tanh", "recurrent_regularizer": null, "return_state": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "return_sequences": false, "unit_forget_bias": true, "units": 256, "implementation": 1, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "unroll": false, "stateful": false, "go_backwards": false, "activity_regularizer": null}, "name": "encoder_lstm", "class_name": "LSTM", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_lstm", "activation": "tanh", "recurrent_regularizer": null, "return_state": true, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "dropout": 0.0, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.0, "return_sequences": true, "unit_forget_bias": true, "units": 256, "implementation": 1, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "unroll": false, "stateful": false, "go_backwards": false, "activity_regularizer": null}, "name": "decoder_lstm", "class_name": "LSTM", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]]}, {"config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "decoder_dense", "activation": "softmax", "units": 1531, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "name": "decoder_dense", "class_name": "Dense", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}